[
  {
    "filename": "text1.txt",
    "numberOfCharacters": 1355,
    "numberOfWords": 274,
    "numberOfSentences": 20,
    "frequencyOfCharacters": {
      "e": 148,
      "t": 132,
      "n": 111,
      "a": 108,
      "o": 103,
      "i": 97,
      "s": 74,
      "r": 70,
      "l": 56,
      "h": 44,
      "u": 41,
      "c": 37,
      "d": 35,
      "g": 30,
      "w": 27,
      "m": 25,
      "f": 23,
      "k": 21,
      "y": 17,
      "p": 16,
      ".": 15,
      "b": 13,
      "P": 11,
      ",": 10,
      "z": 10,
      "x": 8,
      "v": 8,
      "N": 8,
      "L": 8,
      "-": 7,
      "T": 6,
      "?": 5,
      "W": 5,
      "A": 4,
      "I": 3,
      "’": 3,
      "q": 3,
      "S": 2,
      ":": 2,
      "'": 1,
      "M": 1,
      "(": 1,
      ")": 1,
      "C": 1,
      "–": 1,
      "B": 1,
      "‘": 1,
      "E": 1
    },
    "distributionOfCharacters": {
      "e": "10.92 %",
      "t": "9.74 %",
      "n": "8.19 %",
      "a": "7.97 %",
      "o": "7.60 %",
      "i": "7.16 %",
      "s": "5.46 %",
      "r": "5.17 %",
      "l": "4.13 %",
      "h": "3.25 %",
      "u": "3.03 %",
      "c": "2.73 %",
      "d": "2.58 %",
      "g": "2.21 %",
      "w": "1.99 %",
      "m": "1.85 %",
      "f": "1.70 %",
      "k": "1.55 %",
      "y": "1.25 %",
      "p": "1.18 %",
      ".": "1.11 %",
      "b": "0.96 %",
      "P": "0.81 %",
      ",": "0.74 %",
      "z": "0.74 %",
      "x": "0.59 %",
      "v": "0.59 %",
      "N": "0.59 %",
      "L": "0.59 %",
      "-": "0.52 %",
      "T": "0.44 %",
      "?": "0.37 %",
      "W": "0.37 %",
      "A": "0.30 %",
      "I": "0.22 %",
      "’": "0.22 %",
      "q": "0.22 %",
      "S": "0.15 %",
      ":": "0.15 %",
      "'": "0.07 %",
      "M": "0.07 %",
      "(": "0.07 %",
      ")": "0.07 %",
      "C": "0.07 %",
      "–": "0.07 %",
      "B": "0.07 %",
      "‘": "0.07 %",
      "E": "0.07 %"
    },
    "avgWordLength": 4.78,
    "avgNumberOfWordsInSentence": 13.7,
    "topMostUsedWords": {
      "the": 11,
      "to": 9,
      "tokenization": 8,
      "of": 7,
      "text": 7,
      "data": 7,
      "in": 7,
      "we": 6,
      "nlp": 6,
      "and": 5
    },
    "topLongestWords": {
      "lemmatization": 13,
      "prerequisites": 13,
      "comprehensive": 13,
      "unstructured": 12,
      "tokenization": 12,
      "multi-stage": 11,
      "identifying": 11,
      "essentially": 11,
      "fascinated": 10,
      "manipulate": 10
    },
    "topShortestWords": {
      "a": 1,
      "by": 2,
      "of": 2,
      "on": 2,
      "to": 2,
      "be": 2,
      "in": 2,
      "so": 2,
      "we": 2,
      "an": 2
    },
    "topLongestSentences": {
      "Cleaning the data consists of a few key steps: - Word tokenization - Predicting parts of speech for each token - Text lemmatization - Identifying and removing stop words, and much more.": 28,
      "If you’re looking for an end-to-end resource for learning NLP, you should check out our comprehensive course: Natural Language Processing using Python.": 22,
      "Tokenization is essentially splitting a phrase, sentence, paragraph, or an entire text document into smaller units, such as individual words or terms.": 22,
      "We need to clean the unstructured text data first before we can even think about getting to the modeling stage.": 20,
      "Are you looking for ways to work with this text data but aren't sure where to begin?": 17,
      "Tokenization is one of the most common tasks when it comes to working with text data.": 16,
      "Anyone with an interest in NLP or data science will be able to follow along.": 15,
      "So how can we manipulate and clean this text data to build a model?": 14,
      "Are you fascinated by the amount of text data available on the internet?": 13,
      "We will first see what tokenization is and why it’s required in NLP.": 13
    },
    "topShortestSentences": {
      "This article has no prerequisites.": 5,
      "What is Tokenization in NLP?": 5,
      "Solving an NLP problem is a multi-stage process.": 8,
      "But what does the term ‘tokenization’ actually mean?": 8,
      "Each of these smaller units are called tokens.": 8,
      "Machines, after all, recognize numbers, not the letters of our language.": 11,
      "And that can be a tricky landscape to navigate in machine learning.": 12,
      "The answer lies in the wonderful world of Natural Language Processing (NLP).": 12,
      "In this article, we will talk about the very first step – tokenization.": 12,
      "Are you fascinated by the amount of text data available on the internet?": 13
    },
    "numberOfPalindromes": 0,
    "topLongestPalindromes": [],
    "isTextPalindrome": false,
    "reportGeneratedAt": "2021-11-07 00:09:11.135092",
    "timeOfExecution": "-0.002621075999968525 ms"
  },
  {
    "filename": "text2.txt",
    "numberOfCharacters": 560517,
    "numberOfWords": 121674,
    "numberOfSentences": 4660,
    "frequencyOfCharacters": {
      "e": 68709,
      "t": 45870,
      "a": 41244,
      "o": 39862,
      "n": 37460,
      "i": 35211,
      "h": 33398,
      "s": 32609,
      "r": 32214,
      "d": 21767,
      "l": 20862,
      "u": 14963,
      "m": 13057,
      "c": 12838,
      "y": 12365,
      "f": 11854,
      "w": 11670,
      "g": 9859,
      ",": 9146,
      "p": 8052,
      "b": 8012,
      ".": 6185,
      "v": 5709,
      "k": 3112,
      "I": 2569,
      "“": 1792,
      "”": 1741,
      "M": 1702,
      ";": 1553,
      "B": 1078,
      "z": 932,
      "_": 930,
      "x": 839,
      "T": 778,
      "L": 735,
      "’": 723,
      "E": 718,
      "H": 673,
      "W": 635,
      "C": 627,
      "q": 627,
      "j": 551,
      "D": 540,
      "S": 510,
      "!": 494,
      "?": 462,
      "A": 450,
      "—": 396,
      "Y": 345,
      "J": 321,
      "-": 317,
      "N": 236,
      "O": 183,
      "P": 179,
      "G": 173,
      "F": 145,
      ":": 115,
      "K": 95,
      "R": 91,
      "U": 22,
      "1": 19,
      "‘": 19,
      "V": 19,
      "2": 18,
      "(": 18,
      ")": 18,
      "5": 17,
      "3": 16,
      "4": 16,
      "6": 10,
      "ê": 8,
      "8": 7,
      "7": 6,
      "9": 6,
      "0": 6,
      "à": 4,
      "Z": 3,
      "&": 1,
      "é": 1
    },
    "distributionOfCharacters": {
      "e": "12.26 %",
      "t": "8.18 %",
      "a": "7.36 %",
      "o": "7.11 %",
      "n": "6.68 %",
      "i": "6.28 %",
      "h": "5.96 %",
      "s": "5.82 %",
      "r": "5.75 %",
      "d": "3.88 %",
      "l": "3.72 %",
      "u": "2.67 %",
      "m": "2.33 %",
      "c": "2.29 %",
      "y": "2.21 %",
      "f": "2.11 %",
      "w": "2.08 %",
      "g": "1.76 %",
      ",": "1.63 %",
      "p": "1.44 %",
      "b": "1.43 %",
      ".": "1.10 %",
      "v": "1.02 %",
      "k": "0.56 %",
      "I": "0.46 %",
      "“": "0.32 %",
      "”": "0.31 %",
      "M": "0.30 %",
      ";": "0.28 %",
      "B": "0.19 %",
      "z": "0.17 %",
      "_": "0.17 %",
      "x": "0.15 %",
      "T": "0.14 %",
      "L": "0.13 %",
      "’": "0.13 %",
      "E": "0.13 %",
      "H": "0.12 %",
      "W": "0.11 %",
      "C": "0.11 %",
      "q": "0.11 %",
      "j": "0.10 %",
      "D": "0.10 %",
      "S": "0.09 %",
      "!": "0.09 %",
      "?": "0.08 %",
      "A": "0.08 %",
      "—": "0.07 %",
      "Y": "0.06 %",
      "J": "0.06 %",
      "-": "0.06 %",
      "N": "0.04 %",
      "O": "0.03 %",
      "P": "0.03 %",
      "G": "0.03 %",
      "F": "0.03 %",
      ":": "0.02 %",
      "K": "0.02 %",
      "R": "0.02 %",
      "U": "0.00 %",
      "1": "0.00 %",
      "‘": "0.00 %",
      "V": "0.00 %",
      "2": "0.00 %",
      "(": "0.00 %",
      ")": "0.00 %",
      "5": "0.00 %",
      "3": "0.00 %",
      "4": "0.00 %",
      "6": "0.00 %",
      "ê": "0.00 %",
      "8": "0.00 %",
      "7": "0.00 %",
      "9": "0.00 %",
      "0": "0.00 %",
      "à": "0.00 %",
      "Z": "0.00 %",
      "&": "0.00 %",
      "é": "0.00 %"
    },
    "avgWordLength": 4.41,
    "avgNumberOfWordsInSentence": 26.11,
    "topMostUsedWords": {
      "the": 4324,
      "to": 4127,
      "of": 3599,
      "and": 3528,
      "her": 2216,
      "i": 2051,
      "a": 1938,
      "in": 1861,
      "was": 1844,
      "she": 1703
    },
    "topLongestWords": {
      "inconveniencescheerfulness": 26,
      "impartialitydeliberated": 23,
      "intelligenceelizabeth": 21,
      "thoughtre-considering": 21,
      "charlotteimpossible": 19,
      "understandingthough": 19,
      "respectable-looking": 19,
      "povertycomparative": 18,
      "breakfast-parlour": 17,
      "yieldingcertainly": 17
    },
    "topShortestWords": {
      "1": 1,
      "a": 1,
      "i": 1,
      "2": 1,
      "3": 1,
      "4": 1,
      "5": 1,
      "6": 1,
      "7": 1,
      "c": 1
    },
    "topLongestSentences": {
      "Every lingering struggle in his favour grew fainter and fainter; and in farther justification of Mr. Darcy, she could not but allow that Mr. Bingley, when questioned by Jane, had long ago asserted his blamelessness in the affair; that proud and repulsive as were his manners, she had never, in the whole course of their acquaintance—an acquaintance which had latterly brought them much together, and given her a sort of intimacy with his ways—seen anything that betrayed him to be unprincipled or unjust—anything that spoke him of irreligious or immoral habits; that among his own connections he was esteemed and valued—that even Wickham had allowed him merit as a brother, and that she had often heard him speak so affectionately of his sister as to prove him capable of some amiable feeling; that had his actions been what Mr. Wickham represented them, so gross a violation of everything right could hardly have been concealed from the world; and that friendship between a person capable of it, and such an amiable man as Mr. Bingley, was incomprehensible.": 176,
      "But in an instant arose the dreadful suspicion of his being purposely omitted for Mr. Darcy’s pleasure in the Bingleys’ invitation to the officers; and though this was not exactly the case, the absolute fact of his absence was pronounced by his friend Denny, to whom Lydia eagerly applied, and who told them that Wickham had been obliged to go to town on business the day before, and was not yet returned; adding, with a significant smile, “I do not imagine his business would have called him away just now, if he had not wanted to avoid a certain gentleman here.” This part of his intelligence, though unheard by Lydia, was caught by Elizabeth, and, as it assured her that Darcy was not less answerable for Wickham’s absence than if her first surmise had been just, every feeling of displeasure against the former was so sharpened by immediate disappointment, that she could hardly reply with tolerable civility to the polite enquiries which he directly afterwards approached to make.": 168,
      "“Dear Sir,— “The disagreement subsisting between yourself and my late honoured father always gave me much uneasiness, and since I have had the misfortune to lose him, I have frequently wished to heal the breach; but for some time I was kept back by my own doubts, fearing lest it might seem disrespectful to his memory for me to be on good terms with anyone with whom it had always pleased him to be at variance.—‘There, Mrs. Bennet.’—My mind, however, is now made up on the subject, for having received ordination at Easter, I have been so fortunate as to be distinguished by the patronage of the Right Honourable Lady Catherine de Bourgh, widow of Sir Lewis de Bourgh, whose bounty and beneficence has preferred me to the valuable rectory of this parish, where it shall be my earnest endeavour to demean myself with grateful respect towards her ladyship, and be ever ready to perform those rites and ceremonies which are instituted by the Church of England.": 167,
      "But before I am run away with by my feelings on this subject, perhaps it would be advisable for me to state my reasons for marrying—and, moreover, for coming into Hertfordshire with the design of selecting a wife, as I certainly did.” The idea of Mr. Collins, with all his solemn composure, being run away with by his feelings, made Elizabeth so near laughing, that she could not use the short pause he allowed in any attempt to stop him further, and he continued: “My reasons for marrying are, first, that I think it a right thing for every clergyman in easy circumstances (like myself) to set the example of matrimony in his parish; secondly, that I am convinced that it will add very greatly to my happiness; and thirdly—which perhaps I ought to have mentioned earlier, that it is the particular advice and recommendation of the very noble lady whom I have the honour of calling patroness.": 158,
      "Could you expect me to rejoice in the inferiority of your connections?—to congratulate myself on the hope of relations, whose condition in life is so decidedly beneath my own?” Elizabeth felt herself growing more angry every moment; yet she tried to the utmost to speak with composure when she said: “You are mistaken, Mr. Darcy, if you suppose that the mode of your declaration affected me in any other way, than as it spared me the concern which I might have felt in refusing you, had you behaved in a more gentlemanlike manner.” She saw him start at this, but he said nothing, and she continued: “You could not have made the offer of your hand in any possible way that would have tempted me to accept it.” Again his astonishment was obvious; and he looked at her with an expression of mingled incredulity and mortification.": 146,
      "He was resolutely silent, however, and, from a determination of making him speak, she continued: “I remember, when we first knew her in Hertfordshire, how amazed we all were to find that she was a reputed beauty; and I particularly recollect your saying one night, after they had been dining at Netherfield, ‘_She_ a beauty!—I should as soon call her mother a wit.’ But afterwards she seemed to improve on you, and I believe you thought her rather pretty at one time.” “Yes,” replied Darcy, who could contain himself no longer, “but _that_ was only when I first saw her, for it is many months since I have considered her as one of the handsomest women of my acquaintance.” He then went away, and Miss Bingley was left to all the satisfaction of having forced him to say what gave no one any pain but herself.": 146,
      "Mrs. Bennet rejoiced to see Jane in undiminished beauty; and more than once during dinner did Mr. Bennet say voluntarily to Elizabeth: “I am glad you are come back, Lizzy.” Their party in the dining-room was large, for almost all the Lucases came to meet Maria and hear the news; and various were the subjects that occupied them: Lady Lucas was enquiring of Maria, after the welfare and poultry of her eldest daughter; Mrs. Bennet was doubly engaged, on one hand collecting an account of the present fashions from Jane, who sat some way below her, and, on the other, retailing them all to the younger Lucases; and Lydia, in a voice rather louder than any other person’s, was enumerating the various pleasures of the morning to anybody who would hear her.": 132,
      "I remember the time when I liked a red coat myself very well—and, indeed, so I do still at my heart; and if a smart young colonel, with five or six thousand a year, should want one of my girls, I shall not say nay to him; and I thought Colonel Forster looked very becoming the other night at Sir William’s in his regimentals.” “Mamma,” cried Lydia, “my aunt says that Colonel Forster and Captain Carter do not go so often to Miss Watson’s as they did when they first came; she sees them now very often standing in Clarke’s library.” Mrs. Bennet was prevented replying by the entrance of the footman with a note for Miss Bennet; it came from Netherfield, and the servant waited for an answer.": 129,
      "His disposition must be dreadful.” “I will not trust myself on the subject,” replied Wickham; “_I_ can hardly be just to him.” Elizabeth was again deep in thought, and after a time exclaimed, “To treat in such a manner the godson, the friend, the favourite of his father!” She could have added, “A young man, too, like _you_, whose very countenance may vouch for your being amiable”—but she contented herself with, “and one, too, who had probably been his companion from childhood, connected together, as I think you said, in the closest manner!” “We were born in the same parish, within the same park; the greatest part of our youth was passed together; inmates of the same house, sharing the same amusements, objects of the same parental care.": 128,
      "“He seems to be a most conscientious and polite young man, upon my word, and I doubt not will prove a valuable acquaintance, especially if Lady Catherine should be so indulgent as to let him come to us again.” “There is some sense in what he says about the girls, however, and if he is disposed to make them any amends, I shall not be the person to discourage him.” “Though it is difficult,” said Jane, “to guess in what way he can mean to make us the atonement he thinks our due, the wish is certainly to his credit.” Elizabeth was chiefly struck by his extraordinary deference for Lady Catherine, and his kind intention of christening, marrying, and burying his parishioners whenever it were required.": 126
    },
    "topShortestSentences": {
      "“Oh!": 1,
      "“Mr.": 1,
      "yes.": 1,
      "Oh!": 1,
      "“Books—oh!": 1,
      "no.": 1
    },
    "numberOfPalindromes": 325,
    "topLongestPalindromes": [
      "madam",
      "maam",
      "peep",
      "noon",
      "sees",
      "did",
      "eye",
      "ere",
      "gig"
    ],
    "isTextPalindrome": false,
    "reportGeneratedAt": "2021-11-07 00:09:12.779465",
    "timeOfExecution": "-0.003397632000030626 ms"
  }
]
